---
type: ScheduleSortGroupField
namespace: Autodesk.Revit.DB
version: 2024
members: 11
tags: [revit-api, class]
---

# ScheduleSortGroupField

`Autodesk.Revit.DB.ScheduleSortGroupField` · Revit 2024 · 11 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ScheduleSortGroupField | — | `` |
| Constructor | ScheduleSortGroupField | 2013 | `public ScheduleSortGroupField ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | FieldId | 2013 | `public ScheduleFieldId FieldId { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | ShowBlankLine | 2013 | `public bool ShowBlankLine { get ; set ; }` |
| Property | ShowFooter | 2013 | `public bool ShowFooter { get ; set ; }` |
| Property | ShowFooterCount | 2013 | `public bool ShowFooterCount { get ; set ; }` |
| Property | ShowFooterTitle | 2013 | `public bool ShowFooterTitle { get ; set ; }` |
| Property | ShowHeader | 2013 | `public bool ShowHeader { get ; set ; }` |
| Property | SortOrder | 2013 | `public ScheduleSortOrder SortOrder { get ; set ; }` |